import random

fish_names = [
    'щука', 'сом', 'карась', 'короп', 'лосось', 'форель', 'окунь', 'судак', 'плітка', 'голавль',
    'жерех', 'лещ', 'язь', 'голець', 'камбала', 'минь', 'хек', 'морський', 'макрель', 'тріска',
    'йорж', 'пелядь', 'сиг', 'тюлька', 'сардина', 'кілька', 'оселедець', 'скумбрія', 'кефаль', 'бички',
    'моруна', 'палтус', 'пескар', 'гребін', 'горбуша', 'кілька', 'омуль', 'орел', 'кета', 'нарвал',
    'кішка', 'конгріо', 'севрюга', 'чебачок', 'гюрза', 'мартин', 'змій', 'хоку', 'амбіс', 'буйвол',
    'бутус', 'вобла', 'глуш', 'капюш', 'карасі', 'кларіо', 'макерель', 'марлін', 'мінека', 'морж',
    'натотен', 'омар', 'осман', 'піранья', 'покрупа', 'сабель', 'скат', 'стерлядь', 'судак', 'сурмель',
    'талька', 'термопс', 'техонь', 'тунель', 'хоботок', 'халва', 'токам', 'щупак', 'ятоба', 'яперс'
]


officers_characteristics = [
    'веселий', 'сумний', 'надійний', 'брехливий', 'скупий', 'скучний', 'тліючий', 'жвавий', 'замкнений', 'енергійний',
    'лінивий', 'сміливий', 'боязкий', 'спокійний', 'невпевнений', 'комунікабельний', 'самодостатній', 'дружелюбний',
    'агресивний', 'гострозір',
    'оптимістичний', 'песимістичний', 'конфліктний', 'гармонійний', 'амбітний', 'скромний', 'самовпевнений',
    'неорганізований', 'організований',
    'креативний', 'раціональний', 'імпульсивний', 'мудрий', 'нерішучий', 'емоційний', 'логічний', 'інтуїтивний',
    'рішучий', 'шанобливий',
    'недотепний', 'зігрішливий', 'справжній', 'підлеглий', 'лідер', 'невпевнений', 'працьовитий', 'ледачий',
    'врівноважений', 'незалежний',
    'пристрасний', 'задумливий', 'завзятий', 'байдужий', 'альтруїстичний', 'егоїстичний', 'практичний', 'фанатичний',
    'толерантний',
    'нетерплячий', 'спокійний', 'зворушливий', 'безвідповідальний', 'вірний', 'непостійний', 'надійний', 'ненадійний',
    'цілеспрямований',
    'розсіяний', 'помітний', 'непомітний', 'справедливий', 'несправедливий', 'спонтанний', 'стриманий', 'нудний',
    'цікавий', 'безпечний',
    'небезпечний', 'сором\'язливий', 'несором\'язливий', 'лагідний', 'агресивний', 'романтичний', 'практичний',
    'винахідливий', 'стабільний',
    'лабільний', 'піддатливий', 'непіддатливий', 'володій', 'підлеглий', 'дотепний', 'недотепний', 'зворотний',
    'ініціативний', 'безініціативний',
    'естетичний', 'жорстокий', 'ніжний', 'тверезий', 'п\'яний', 'витончений', 'грубий', 'пристрастий', 'злодій',
    'справедливий'
]

professions_list = [
    'металург', 'сталевар', 'зварювальник', 'літейник', 'коваль', 'технолог', 'прокатник', 'машинобудівник',
    'металообробник', 'фрезерувальник', 'шліфувальник', 'токар', 'оператор', 'плавильник', 'монтажник',
    'електромонтер', 'слюсар', 'газорізальник', 'контролер', 'гірник', 'бурильник', 'підривник', 'збагачувальник',
    'кранівник', 'екскаваторник', 'доменщик', 'робітник', 'лаборант', 'механік', 'зварник', 'терміст',
    'електрик', 'вальцювальник', 'конструктор', 'прохідник', 'майстер', 'начальник', 'випробувальник', 'коваль',
    'обробник', 'оператор', 'токар', 'фахівець', 'кастелян', 'цирюльник', 'шліфувальник', 'гравер', 'інженер',
    'майстер', 'лікар', 'фельдшер', 'стоматолог', 'хірург', 'терапевт', 'педіатр', 'офтальмолог', 'невропатолог',
    'ортопед', 'кардіолог', 'дерматолог', 'гастроентеролог', 'ендокринолог', 'отоларинголог', 'пульмонолог',
    'психіатр', 'реаніматолог', 'інфекціоніст', 'мамолог', 'онколог', 'уролог', 'акушер', 'гінеколог',
    'анестезіолог', 'алерголог', 'гематолог', 'токсиколог', 'хіміотерапевт', 'нефролог', 'реабілітолог'
]


# Create dict for conversation
keyboard_layout = {
    'а': 'f', 'б': ',', 'в': 'd', 'г': 'u', 'ґ': '`', 'д': 'l', 'е': 't', 'є': '\'',
    'ж': ';', 'з': 'p', 'и': 'b', 'і': 's', 'ї': ']', 'й': 'q', 'к': 'r', 'л': 'k',
    'м': 'v', 'н': 'y', 'о': 'j', 'п': 'g', 'р': 'h', 'с': 'c', 'т': 'n', 'у': 'e',
    'ф': 'a', 'х': '[', 'ц': 'w', 'ч': 'x', 'ш': 'i', 'щ': 'o', 'ь': 'm', 'ю': '.',
    'я': 'z', 'А': 'F', 'Б': '<', 'В': 'D', 'Г': 'U', 'Ґ': '~', 'Д': 'L', 'Е': 'T',
    'Є': '\"', 'Ж': ':', 'З': 'P', 'И': 'B', 'І': 'S', 'Ї': '}', 'Й': 'Q', 'К': 'R',
    'Л': 'K', 'М': 'V', 'Н': 'Y', 'О': 'J', 'П': 'G', 'Р': 'H', 'С': 'C', 'Т': 'N',
    'У': 'E', 'Ф': 'A', 'Х': '{', 'Ц': 'W', 'Ч': 'X', 'Ш': 'I', 'Щ': 'O', 'Ь': 'M',
    'Ю': '>', 'Я': 'Z'
}

# Generating 50 lines for file, u can change range for generating more words
lines = []
single_words_lines = []
for _ in range(50):
    rank = random.choice(fish_names).capitalize()
    characteristic = random.choice(officers_characteristics)
    profession = random.choice(professions_list)
    random_numbers = random.choice([str(i) for i in range(1, 101)])

    # Convert every symbol from keyboard
    rank_converted = ''.join(keyboard_layout.get(letter, letter) for letter in rank)
    characteristic_converted = ''.join(keyboard_layout.get(letter, letter) for letter in characteristic)
    profession_converted = ''.join(keyboard_layout.get(letter, letter) for letter in profession)
    random_numbers_converted = ''.join(keyboard_layout.get(letter, letter) for letter in random_numbers)

    lines.append(
        f'{rank} {characteristic} {profession} {random_numbers} - {rank_converted} {characteristic_converted} {profession_converted} {random_numbers_converted}')
    single_words_lines.append(
        f'{rank} {characteristic} {profession} {random_numbers}')

with open("passwords_kp.txt", "w", encoding="utf-8") as file:
    for line in lines:
        file.write(line + '\n')

with open("passwords_words_kp.txt", "w", encoding="utf-8") as word_file:
    for single_word in single_words_lines:
        word_file.write(single_word + '\n')
